sw-rails/app/controllers/films_controller.rb

INSERT INTO "films" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Empire Strikes Back"], ["created_at", 2017-05-04 20:58:29 UTC], ["updated_at", 2017-05-04 20:58:29 UTC]]
---
  def create
    @film = Film.new(film_params)

    respond_to do |format|
      # If the requester asked for an HTML response, we'll treat it as a normal request
      format.html do
        if @film.save